----+-*A-1-B--+----2----+----3----+----4----+----5----+----6----+----7----+----
******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELOWRLD.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world" 
            DISPLAY "I am fine"         
            STOP RUN.
       END PROGRAM HELOWRLD.
